# appdir and require_sha are set per program because of various issues
# 
# 1password _NEEDS_ to be in /Applications to work correctly
# AppFlowy seems to have a borked sha

cask "1password@beta", appdir: "/Applications", require_sha: true
cask "appflowy", appdir: "~/Applications", require_sha: false
cask "discord", appdir: "~/Applications", require_sha: true
cask "fantastical", appdir: "~/Applications", require_sha: true
cask "firefox@developer-edition", appdir: "~/Applications", require_sha: true
cask "logitech-options", appdir: "~/Applications", require_sha: true
cask "mailspring", appdir: "~/Applications", require_sha: true
cask "ollama", appdir: "~/Applications", require_sha: true
cask "signal@beta", appdir: "~/Applications", require_sha: true
cask "spotify", appdir: "~/Applications", require_sha: true
cask "telegram-desktop@beta", appdir: "~/Applications", require_sha: true
cask "whatsapp@beta", appdir: "~/Applications", require_sha: true
cask "winbox", appdir: "~/Applications", require_sha: true

mas "Reeder.", id: 6475002485
mas "Xcode", id: 497799835

